-- MySQL dump 10.13  Distrib 8.0.43, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: library
-- ------------------------------------------------------
-- Server version	9.4.0

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `characters`
--

DROP TABLE IF EXISTS `characters`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `characters` (
  `id` int NOT NULL AUTO_INCREMENT,
  `book_id` int NOT NULL,
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `word_boundary` tinyint(1) DEFAULT NULL,
  `split_words` tinyint(1) DEFAULT NULL,
  `custom_pattern` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `book_id` (`book_id`),
  CONSTRAINT `characters_ibfk_1` FOREIGN KEY (`book_id`) REFERENCES `books` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=143 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `characters`
--

LOCK TABLES `characters` WRITE;
/*!40000 ALTER TABLE `characters` DISABLE KEYS */;
INSERT INTO `characters` VALUES (1,1,'Вера Николаевна Шеина',1,0,NULL),(2,1,'Василий Львович Шеин',1,0,NULL),(3,1,'Георгий Степанович Желтков',1,0,NULL),(4,1,'Генерал Яков Михайлович Аносов',1,0,NULL),(5,1,'Николай Николаевич Мирза–Булат–Туганский',1,0,NULL),(6,1,'Анна',1,0,NULL),(7,1,'Густав Иванович Фриессе',1,0,NULL),(8,1,'Пономарев',1,0,NULL),(9,1,'Бахтинский',1,0,NULL),(10,1,'Женни Рейтер',1,0,NULL),(11,1,'Лука',1,0,NULL),(12,1,'Васючок',1,0,NULL),(13,2,'Марфа Игнатьевна Кабанова',1,0,NULL),(14,2,'Тихон Иваныч Кабанов',1,0,NULL),(15,2,'Катерина Петровна Кабанова',1,0,NULL),(16,2,'Варвара Кабанова',1,0,NULL),(17,2,'Иван Кудряш',1,0,NULL),(18,2,'Кулигин',1,0,NULL),(19,2,'Савел Прокофьевич Дикой',1,0,NULL),(20,2,'Борис Григорьевич',1,0,NULL),(21,2,'Феклуша',1,0,NULL),(22,2,'Глаша',1,0,NULL),(23,3,'Любовь Андреевна Раневская',1,0,NULL),(24,3,'Лопахин Ермолай Алексеевич',1,0,NULL),(25,3,'Гаев Леонид Андреевич',1,0,NULL),(26,3,'Петр Сергеевич Трофимов',1,0,NULL),(27,3,'Анна Раневская',1,0,NULL),(28,3,'Варя',1,0,NULL),(29,3,'Борис Борисович Симеонов-Пищик',1,0,NULL),(30,3,'Шарлотта Ивановна',1,0,NULL),(31,3,'Семен Пантелеевич Епиходов',1,0,NULL),(32,3,'Дуняша',1,0,NULL),(33,3,'Фирс Николаевич',1,0,NULL),(34,3,'Яша',1,0,NULL),(35,4,'Павел Афанасьевич Фамусов',1,0,NULL),(36,4,'Софья Павловна',1,0,NULL),(37,4,'Лиза',1,0,NULL),(38,4,'Алексей Степанович Мочалин',1,0,NULL),(39,4,'Александр Андреевич Чацкий',1,0,NULL),(40,4,'Сергей Сергеевич Скалозуб',1,0,NULL),(41,4,'Репетилов',1,0,NULL),(42,4,'Загорецкий',1,0,NULL),(43,4,'Хлестова',1,0,NULL),(44,4,'Платон Михайлович Горич',1,0,NULL),(45,4,'Наталья Дмитриевна Горич',1,0,NULL),(46,4,'Князь Тугоуховский',1,0,NULL),(47,4,'Княгиня Тугоуховская',1,0,NULL),(48,4,'Петрушка',1,0,NULL),(49,5,'Евгений Онегин',1,0,NULL),(50,5,'Татьяна Ларина',1,0,NULL),(51,5,'Владимир Ленский',1,0,NULL),(52,5,'Ольга Ларина',1,0,NULL),(53,5,'Прасковья Ларина',1,0,NULL),(54,5,'Зарецкий',1,0,NULL),(55,5,'Филипьевна',1,0,NULL),(56,7,'Илья Ильич Обломов',1,0,NULL),(57,7,'Андрей Иванович Штольц',1,0,NULL),(58,7,'Ольга Сергеевна Ильинская',1,0,NULL),(59,7,'Агафья Матвеевна Пшеницына',1,0,NULL),(60,7,'Захар Трофимович',1,0,NULL),(61,7,'Михаил Андреевич Тарантьев',1,0,NULL),(62,7,'Анисья',1,0,NULL),(63,7,'Иван Матвеевич Мухояров',1,0,NULL),(64,7,'Волков',1,0,NULL),(65,7,'Судьбинский',1,0,NULL),(66,7,'Пенкин',1,0,NULL),(67,7,'Иван Алексеевич Алексеев',1,0,NULL),(68,8,'Евгений Васильевич Базаров',1,0,NULL),(69,8,'Николай Петрович Кирсанов',1,0,NULL),(70,8,'Аркадий Николаевич Кирсанов',1,0,NULL),(71,8,'Павел Петрович Кирсанов',1,0,NULL),(72,8,'Василий Иванович Базаров',1,0,NULL),(73,8,'Арина Власьевна Базарова',1,0,NULL),(74,8,'Анна Сергеевна Одинцова',1,0,NULL),(75,8,'Катерина',1,0,NULL),(76,8,'Виктор Ситников',1,0,NULL),(77,8,'Авдотья Кукшина',1,0,NULL),(78,8,'Фенечка',1,0,NULL),(79,8,'Дуняша',1,0,NULL),(80,8,'Петр',1,0,NULL),(81,10,'Мастер',1,0,NULL),(82,10,'Маргарита Николаевна',1,0,NULL),(83,10,'Фагот',1,0,NULL),(84,10,'Воланд',1,0,NULL),(85,10,'Азазелло',1,0,NULL),(86,10,'Кот Бегемот',1,0,NULL),(87,10,'Гелла',1,0,NULL),(88,10,'Берлиоз Михаил Александрович',1,0,NULL),(89,10,'Бездомный Иван Николаевич',1,0,NULL),(90,10,'Лиходеев Степан Богданович',1,0,NULL),(91,10,'Босой Никанор Иванович',1,0,NULL),(92,10,'Алоизий Могарыч',1,0,NULL),(93,10,'Аннушка',1,0,NULL),(94,10,'Понтий Пилат',1,0,NULL),(95,10,'Иешуа Га-Ноцри',1,0,NULL),(96,11,'Костылев Михаил Иванович',1,0,NULL),(97,11,'Василиса Карповна',1,0,NULL),(98,11,'Наталья Карповна',1,0,NULL),(99,11,'Васька Пепел',1,0,NULL),(100,11,'Андрей Митрич Клещ',1,0,NULL),(101,11,'Анна',1,0,NULL),(102,11,'Барон',1,0,NULL),(103,11,'Настя',1,0,NULL),(104,11,'Бубнов',1,0,NULL),(105,11,'Сатин',1,0,NULL),(106,11,'Актер',1,0,NULL),(107,11,'Медведев',1,0,NULL),(108,11,'Квашня',1,0,NULL),(109,11,'Алешка',1,0,NULL),(110,11,'Татарин',1,0,NULL),(111,11,'Кривой Зоб',1,0,NULL),(112,13,'Григорий Александрович Печорин',1,0,NULL),(113,13,'Максим Максимыч',1,0,NULL),(114,13,'Бэла',1,0,NULL),(115,13,'Мери Лиговская',1,0,NULL),(116,13,'Грушницкий',1,0,NULL),(117,13,'Вера',1,0,NULL),(118,13,'Вернер',1,0,NULL),(119,14,'Павел Иванович Чичиков',1,0,NULL),(120,14,'Манилов',1,0,NULL),(121,14,'Настасья Петровна Коробочка',1,0,NULL),(122,14,'Ноздрёв',1,0,NULL),(123,14,'Михаил Семёнович Собакевич',1,0,NULL),(124,14,'Степан Плюшкин',1,0,NULL),(125,14,'Петрушка',1,0,NULL),(126,14,'Селифан',1,0,NULL),(127,16,'Родион Романович Раскольников',1,0,NULL),(128,16,'Алёна Ивановна',1,0,NULL),(129,16,'Мармеладов Семён Захарович',1,0,NULL),(130,16,'Софья Семёновна Мармеладова',1,0,NULL),(131,16,'Пульхерия Александровна Раскольникова',1,0,NULL),(132,16,'Авдотья Романовна Раскольникова',1,0,NULL),(133,16,'Катерина Ивановна Мармеладова',1,0,NULL),(134,16,'Лужин Пётр Петрович',1,0,NULL),(135,16,'Разумихин Дмитрий Прокофьевич',1,0,NULL),(136,16,'Свидригайлов Аркадий Иванович',1,0,NULL),(137,16,'Лебезятников Андрей Семёнович',1,0,NULL),(138,16,'Зосимов',1,0,NULL),(139,16,'Заметов Александр Григорьевич',1,0,NULL),(140,16,'Никодим Фомич',1,0,NULL),(141,16,'Порфирий Петрович',1,0,NULL),(142,16,'Илья Петрович',1,0,NULL);
/*!40000 ALTER TABLE `characters` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-09-18 19:29:04
